app/controllers/jobs_controller.rb

SELECT "categories".* FROM "categories"
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Full Time"], ["LIMIT", 1]]
---
  def index
    if params[:category].blank?
      @jobs = Job.all.order("created_at DESC")
    else
      @category_id = Category.find_by(name: params[:category]).id